Revit 2026 API

# ConnectorConnectorManager Property

---

The connector manager of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectorManager ConnectorManager { get; }
```
```vb
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
```
```cpp
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
```
```fsharp
member ConnectorManager : ConnectorManager with get
```

#### Property Value

ConnectorManager

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown on failure to get connector manager. |

#### Reference

Connector Class

Autodesk.Revit.DB Namespace